{
  "irVersion": "1.0",
  "project": "agentcomms",
  "repository": "https://github.com/plexusone/agentcomms",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-03-16",
      "highlights": [
        { "description": "Multi-agent communication: agents can discover each other and send messages for task delegation and coordination" },
        { "description": "Unified JSON configuration: single config.json replaces split env vars + YAML configuration" },
        { "description": "Inbound message polling: MCP tools for agents to check for human messages during long tasks" },
        { "description": "MkDocs documentation site with comprehensive guides" }
      ],
      "added": [
        { "description": "Multi-agent support with agent discovery and cross-agent messaging", "commit": "9cd0653" },
        { "description": "`list_agents` MCP tool - discover available agents and their status", "commit": "9cd0653" },
        { "description": "`send_agent_message` MCP tool - send message to another agent", "commit": "9cd0653" },
        { "description": "`agent_message` IPC method for daemon cross-agent routing", "commit": "86d673b" },
        { "description": "Agent status tracking (online/offline) in router", "commit": "ce90593" },
        { "description": "`source_agent_id` field in Event schema for agent-to-agent messages", "commit": "4e2b1be" },
        { "description": "`check_messages` MCP tool - poll for human messages", "commit": "e2c2cae" },
        { "description": "`get_agent_events` MCP tool - get all events with pagination", "commit": "e2c2cae" },
        { "description": "`daemon_status` MCP tool - check if daemon is running", "commit": "e2c2cae" },
        { "description": "Unified JSON configuration with environment variable substitution", "commit": "84fc12b" },
        { "description": "`agentcomms config init` command to generate configuration", "commit": "49a8727" },
        { "description": "`agentcomms config validate` command to validate configuration", "commit": "84fc12b" },
        { "description": "Daemon infrastructure for Human → Agent communication", "commit": "408f576" },
        { "description": "Actor-style router with per-agent goroutines", "commit": "408f576" },
        { "description": "tmux adapter for sending messages to agent terminals", "commit": "408f576" },
        { "description": "Event store with SQLite database via Ent ORM", "commit": "fc800cc" },
        { "description": "CLI commands: daemon, status, agents, send, interrupt, events, reply, channels", "commit": "f959064" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site at plexusone.github.io/agentcomms", "commit": "179b3de" },
        { "description": "Getting Started, CLI, MCP Tools, Configuration, and Architecture guides", "commit": "179b3de" },
        { "description": "Multi-agent communication documentation", "commit": "55b31e3" },
        { "description": "FEAT_INBOUND design documents (PRD, TRD, Implementation Plan)", "commit": "fe76dd4" },
        { "description": "Updated README with inbound features and daemon CLI", "commit": "a477e73" }
      ],
      "chore": [
        { "description": "Update TASKS.md with unified JSON config completion", "commit": "1399085" },
        { "description": "Update dependencies and add task tracking", "commit": "68588e2" }
      ],
      "dependencies": [
        { "description": "Pin tablewriter v0.0.5 for ent v0.14.5 compatibility", "commit": "62a27c4" },
        { "description": "Add entgo.io/ent v0.14.5 for database ORM", "commit": "fc800cc" },
        { "description": "Add modernc.org/sqlite v1.46.1 for pure Go SQLite", "commit": "fc800cc" },
        { "description": "Update modelcontextprotocol/go-sdk to v1.4.1", "commit": "0c13625" },
        { "description": "Update assistantkit to v0.12.0", "commit": "8ac8e78" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-03-07",
      "highlights": [
        { "description": "Renamed from agentcall to agentcomms with expanded scope: voice calls AND chat messaging for AI assistants" },
        { "description": "Added chat messaging support via Discord, Telegram, and WhatsApp using the omnichat stack" },
        { "description": "Simplified imports with omnivoice v0.6.0 re-exported types" }
      ],
      "breaking": [
        { "description": "Module renamed from `github.com/agentplexus/agentcall` to `github.com/plexusone/agentcomms`", "commit": "7dbcdc8" },
        { "description": "Environment variable prefix changed from `AGENTCALL_*` to `AGENTCOMMS_*` (legacy prefix still supported)", "commit": "7dbcdc8" }
      ],
      "upgradeGuide": [
        { "description": "Update import paths from `github.com/agentplexus/agentcall` to `github.com/plexusone/agentcomms`" },
        { "description": "Rename environment variables from `AGENTCALL_*` to `AGENTCOMMS_*` (optional, legacy prefix still works)" }
      ],
      "added": [
        { "description": "Chat messaging support via omnichat integration (Discord, Telegram, WhatsApp)", "commit": "7dbcdc8" },
        { "description": "`send_message` MCP tool - send message via Discord, Telegram, or WhatsApp", "commit": "7dbcdc8" },
        { "description": "`list_channels` MCP tool - list available chat providers and their status", "commit": "7dbcdc8" },
        { "description": "`get_messages` MCP tool - retrieve conversation history from a chat channel", "commit": "7dbcdc8" },
        { "description": "`pkg/chat` package with chat manager for multi-provider routing", "commit": "7dbcdc8" },
        { "description": "Configurable voice providers - TTS and STT can each be set to ElevenLabs, Deepgram, or OpenAI independently", "commit": "05daa1e" },
        { "description": "`AGENTCOMMS_TTS_PROVIDER` environment variable to select TTS provider", "commit": "05daa1e" },
        { "description": "`AGENTCOMMS_STT_PROVIDER` environment variable to select STT provider", "commit": "05daa1e" },
        { "description": "OpenAI voice provider support via omnivoice-openai integration", "commit": "7dbcdc8" }
      ],
      "changed": [
        { "description": "Module renamed from agentcall to agentcomms", "commit": "7dbcdc8" },
        { "description": "Package `pkg/callmanager` renamed to `pkg/voice`", "commit": "7dbcdc8" },
        { "description": "Use omnivoice v0.6.0 with re-exported callsystem types for simpler imports", "commit": "ff89e42" },
        { "description": "Migrate logging from `log` to `log/slog` for structured logging", "commit": "e2f2187" },
        { "description": "API keys now only required for selected providers", "commit": "05daa1e" }
      ],
      "security": [
        { "description": "Fix potential log injection vulnerability in user input handling", "commit": "4bfa155" }
      ],
      "documentation": [
        { "description": "README updated with chat messaging documentation and architecture diagram", "commit": "7dbcdc8" },
        { "description": "Add UTF-8 emoji icons to Features section", "commit": "c214139" },
        { "description": "Update Go version requirement to 1.25+", "commit": "c214139" },
        { "description": "Update shields and formatting", "commit": "16db421" },
        { "description": "Add provider selection configuration and cost comparison table", "commit": "d2cb74f" }
      ],
      "chore": [
        { "description": "Remove compiled binary from git and update .gitignore", "commit": "c98bf22" },
        { "description": "Update changelog and gitignore", "commit": "7152339" }
      ],
      "ci": [
        { "description": "Update to shared CI/CD pipelines", "commit": "ba11d1a" }
      ],
      "dependencies": [
        { "description": "Update omnivoice to v0.6.0 (re-exports callsystem types)", "commit": "ff89e42" },
        { "description": "Add omnichat v0.3.0 for chat messaging", "commit": "7dbcdc8" },
        { "description": "Update modelcontextprotocol/go-sdk to v1.4.0", "commit": "d2aca7e" },
        { "description": "Update assistantkit to v0.11.0", "commit": "7dbcdc8" },
        { "description": "Update mcpkit to v0.4.0", "commit": "7dbcdc8" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-19",
      "highlights": [
        { "description": "MCP plugin enabling AI coding assistants (Claude Code, AWS Kiro, Gemini CLI) to make phone calls to users for task completion, clarification, or complex discussions" },
        { "description": "Premium voice quality using ElevenLabs streaming TTS and Deepgram streaming STT" },
        { "description": "Single 53 MB Go binary with no runtime dependencies" }
      ],
      "added": [
        { "description": "MCP voice call plugin with omnivoice stack integration", "commit": "5a69eb9" },
        { "description": "`initiate_call` tool - start a new call to the user with initial message", "commit": "5a69eb9" },
        { "description": "`continue_call` tool - continue conversation on active call", "commit": "5a69eb9" },
        { "description": "`speak_to_user` tool - speak without waiting for response", "commit": "5a69eb9" },
        { "description": "`end_call` tool - end call with optional goodbye message", "commit": "5a69eb9" },
        { "description": "Call manager orchestrating TTS, STT, and phone providers", "commit": "5a69eb9" },
        { "description": "Multi-assistant plugin generator for Claude Code, AWS Kiro CLI, and Gemini CLI", "commit": "a84a09f" },
        { "description": "MCP plugin configuration and build artifacts", "commit": "a84a09f" }
      ],
      "fixed": [
        { "description": "Downgrade ngrok to v1.12.0 and pin log15/v3 to v3.0.0-testing.5 for build compatibility", "commit": "cefd410" }
      ],
      "changed": [
        { "description": "Update go.mod dependencies", "commit": "8340013" }
      ],
      "documentation": [
        { "description": "README with architecture diagram, installation, configuration, and usage", "commit": "300f5d5" },
        { "description": "Roadmap and usage documentation", "commit": "300f5d5" },
        { "description": "README formatting improvements", "commit": "18613b9" }
      ],
      "chore": [
        { "description": "Project configuration files (.gitignore, .golangci.yaml, LICENSE)", "commit": "ceb2943" }
      ],
      "ci": [
        { "description": "GitHub Actions workflows for CI/CD", "commit": "57fb1d9" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "57fb1d9" }
      ]
    }
  ]
}
